----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 64, 32, 32]           1,728
       BatchNorm2d-2           [-1, 64, 32, 32]             128
            Conv2d-3           [-1, 64, 32, 32]           4,096
       BatchNorm2d-4           [-1, 64, 32, 32]             128
            Conv2d-5           [-1, 64, 32, 32]          36,864
       BatchNorm2d-6           [-1, 64, 32, 32]             128
            Conv2d-7          [-1, 256, 32, 32]          16,384
       BatchNorm2d-8          [-1, 256, 32, 32]             512
            Conv2d-9          [-1, 256, 32, 32]          16,384
      BatchNorm2d-10          [-1, 256, 32, 32]             512
       Bottleneck-11          [-1, 256, 32, 32]               0
           Conv2d-12           [-1, 64, 32, 32]          16,384
      BatchNorm2d-13           [-1, 64, 32, 32]             128
           Conv2d-14           [-1, 64, 32, 32]          36,864
      BatchNorm2d-15           [-1, 64, 32, 32]             128
           Conv2d-16          [-1, 256, 32, 32]          16,384
      BatchNorm2d-17          [-1, 256, 32, 32]             512
       Bottleneck-18          [-1, 256, 32, 32]               0
           Conv2d-19           [-1, 64, 32, 32]          16,384
      BatchNorm2d-20           [-1, 64, 32, 32]             128
           Conv2d-21           [-1, 64, 32, 32]          36,864
      BatchNorm2d-22           [-1, 64, 32, 32]             128
           Conv2d-23          [-1, 256, 32, 32]          16,384
      BatchNorm2d-24          [-1, 256, 32, 32]             512
       Bottleneck-25          [-1, 256, 32, 32]               0
           Conv2d-26          [-1, 128, 32, 32]          32,768
      BatchNorm2d-27          [-1, 128, 32, 32]             256
           Conv2d-28          [-1, 128, 16, 16]         147,456
      BatchNorm2d-29          [-1, 128, 16, 16]             256
           Conv2d-30          [-1, 512, 16, 16]          65,536
      BatchNorm2d-31          [-1, 512, 16, 16]           1,024
           Conv2d-32          [-1, 512, 16, 16]         131,072
      BatchNorm2d-33          [-1, 512, 16, 16]           1,024
       Bottleneck-34          [-1, 512, 16, 16]               0
           Conv2d-35          [-1, 128, 16, 16]          65,536
      BatchNorm2d-36          [-1, 128, 16, 16]             256
           Conv2d-37          [-1, 128, 16, 16]         147,456
      BatchNorm2d-38          [-1, 128, 16, 16]             256
           Conv2d-39          [-1, 512, 16, 16]          65,536
      BatchNorm2d-40          [-1, 512, 16, 16]           1,024
       Bottleneck-41          [-1, 512, 16, 16]               0
           Conv2d-42          [-1, 128, 16, 16]          65,536
      BatchNorm2d-43          [-1, 128, 16, 16]             256
           Conv2d-44          [-1, 128, 16, 16]         147,456
      BatchNorm2d-45          [-1, 128, 16, 16]             256
           Conv2d-46          [-1, 512, 16, 16]          65,536
      BatchNorm2d-47          [-1, 512, 16, 16]           1,024
       Bottleneck-48          [-1, 512, 16, 16]               0
           Conv2d-49          [-1, 128, 16, 16]          65,536
      BatchNorm2d-50          [-1, 128, 16, 16]             256
           Conv2d-51          [-1, 128, 16, 16]         147,456
      BatchNorm2d-52          [-1, 128, 16, 16]             256
           Conv2d-53          [-1, 512, 16, 16]          65,536
      BatchNorm2d-54          [-1, 512, 16, 16]           1,024
       Bottleneck-55          [-1, 512, 16, 16]               0
           Conv2d-56          [-1, 256, 16, 16]         131,072
      BatchNorm2d-57          [-1, 256, 16, 16]             512
           Conv2d-58            [-1, 256, 8, 8]         589,824
      BatchNorm2d-59            [-1, 256, 8, 8]             512
           Conv2d-60           [-1, 1024, 8, 8]         262,144
      BatchNorm2d-61           [-1, 1024, 8, 8]           2,048
           Conv2d-62           [-1, 1024, 8, 8]         524,288
      BatchNorm2d-63           [-1, 1024, 8, 8]           2,048
       Bottleneck-64           [-1, 1024, 8, 8]               0
           Conv2d-65            [-1, 256, 8, 8]         262,144
      BatchNorm2d-66            [-1, 256, 8, 8]             512
           Conv2d-67            [-1, 256, 8, 8]         589,824
      BatchNorm2d-68            [-1, 256, 8, 8]             512
           Conv2d-69           [-1, 1024, 8, 8]         262,144
      BatchNorm2d-70           [-1, 1024, 8, 8]           2,048
       Bottleneck-71           [-1, 1024, 8, 8]               0
           Conv2d-72            [-1, 256, 8, 8]         262,144
      BatchNorm2d-73            [-1, 256, 8, 8]             512
           Conv2d-74            [-1, 256, 8, 8]         589,824
      BatchNorm2d-75            [-1, 256, 8, 8]             512
           Conv2d-76           [-1, 1024, 8, 8]         262,144
      BatchNorm2d-77           [-1, 1024, 8, 8]           2,048
       Bottleneck-78           [-1, 1024, 8, 8]               0
           Conv2d-79            [-1, 256, 8, 8]         262,144
      BatchNorm2d-80            [-1, 256, 8, 8]             512
           Conv2d-81            [-1, 256, 8, 8]         589,824
      BatchNorm2d-82            [-1, 256, 8, 8]             512
           Conv2d-83           [-1, 1024, 8, 8]         262,144
      BatchNorm2d-84           [-1, 1024, 8, 8]           2,048
       Bottleneck-85           [-1, 1024, 8, 8]               0
           Conv2d-86            [-1, 256, 8, 8]         262,144
      BatchNorm2d-87            [-1, 256, 8, 8]             512
           Conv2d-88            [-1, 256, 8, 8]         589,824
      BatchNorm2d-89            [-1, 256, 8, 8]             512
           Conv2d-90           [-1, 1024, 8, 8]         262,144
      BatchNorm2d-91           [-1, 1024, 8, 8]           2,048
       Bottleneck-92           [-1, 1024, 8, 8]               0
           Conv2d-93            [-1, 256, 8, 8]         262,144
      BatchNorm2d-94            [-1, 256, 8, 8]             512
           Conv2d-95            [-1, 256, 8, 8]         589,824
      BatchNorm2d-96            [-1, 256, 8, 8]             512
           Conv2d-97           [-1, 1024, 8, 8]         262,144
      BatchNorm2d-98           [-1, 1024, 8, 8]           2,048
       Bottleneck-99           [-1, 1024, 8, 8]               0
          Conv2d-100            [-1, 256, 8, 8]         262,144
     BatchNorm2d-101            [-1, 256, 8, 8]             512
          Conv2d-102            [-1, 256, 8, 8]         589,824
     BatchNorm2d-103            [-1, 256, 8, 8]             512
          Conv2d-104           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-105           [-1, 1024, 8, 8]           2,048
      Bottleneck-106           [-1, 1024, 8, 8]               0
          Conv2d-107            [-1, 256, 8, 8]         262,144
     BatchNorm2d-108            [-1, 256, 8, 8]             512
          Conv2d-109            [-1, 256, 8, 8]         589,824
     BatchNorm2d-110            [-1, 256, 8, 8]             512
          Conv2d-111           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-112           [-1, 1024, 8, 8]           2,048
      Bottleneck-113           [-1, 1024, 8, 8]               0
          Conv2d-114            [-1, 256, 8, 8]         262,144
     BatchNorm2d-115            [-1, 256, 8, 8]             512
          Conv2d-116            [-1, 256, 8, 8]         589,824
     BatchNorm2d-117            [-1, 256, 8, 8]             512
          Conv2d-118           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-119           [-1, 1024, 8, 8]           2,048
      Bottleneck-120           [-1, 1024, 8, 8]               0
          Conv2d-121            [-1, 256, 8, 8]         262,144
     BatchNorm2d-122            [-1, 256, 8, 8]             512
          Conv2d-123            [-1, 256, 8, 8]         589,824
     BatchNorm2d-124            [-1, 256, 8, 8]             512
          Conv2d-125           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-126           [-1, 1024, 8, 8]           2,048
      Bottleneck-127           [-1, 1024, 8, 8]               0
          Conv2d-128            [-1, 256, 8, 8]         262,144
     BatchNorm2d-129            [-1, 256, 8, 8]             512
          Conv2d-130            [-1, 256, 8, 8]         589,824
     BatchNorm2d-131            [-1, 256, 8, 8]             512
          Conv2d-132           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-133           [-1, 1024, 8, 8]           2,048
      Bottleneck-134           [-1, 1024, 8, 8]               0
          Conv2d-135            [-1, 256, 8, 8]         262,144
     BatchNorm2d-136            [-1, 256, 8, 8]             512
          Conv2d-137            [-1, 256, 8, 8]         589,824
     BatchNorm2d-138            [-1, 256, 8, 8]             512
          Conv2d-139           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-140           [-1, 1024, 8, 8]           2,048
      Bottleneck-141           [-1, 1024, 8, 8]               0
          Conv2d-142            [-1, 256, 8, 8]         262,144
     BatchNorm2d-143            [-1, 256, 8, 8]             512
          Conv2d-144            [-1, 256, 8, 8]         589,824
     BatchNorm2d-145            [-1, 256, 8, 8]             512
          Conv2d-146           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-147           [-1, 1024, 8, 8]           2,048
      Bottleneck-148           [-1, 1024, 8, 8]               0
          Conv2d-149            [-1, 256, 8, 8]         262,144
     BatchNorm2d-150            [-1, 256, 8, 8]             512
          Conv2d-151            [-1, 256, 8, 8]         589,824
     BatchNorm2d-152            [-1, 256, 8, 8]             512
          Conv2d-153           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-154           [-1, 1024, 8, 8]           2,048
      Bottleneck-155           [-1, 1024, 8, 8]               0
          Conv2d-156            [-1, 256, 8, 8]         262,144
     BatchNorm2d-157            [-1, 256, 8, 8]             512
          Conv2d-158            [-1, 256, 8, 8]         589,824
     BatchNorm2d-159            [-1, 256, 8, 8]             512
          Conv2d-160           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-161           [-1, 1024, 8, 8]           2,048
      Bottleneck-162           [-1, 1024, 8, 8]               0
          Conv2d-163            [-1, 256, 8, 8]         262,144
     BatchNorm2d-164            [-1, 256, 8, 8]             512
          Conv2d-165            [-1, 256, 8, 8]         589,824
     BatchNorm2d-166            [-1, 256, 8, 8]             512
          Conv2d-167           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-168           [-1, 1024, 8, 8]           2,048
      Bottleneck-169           [-1, 1024, 8, 8]               0
          Conv2d-170            [-1, 256, 8, 8]         262,144
     BatchNorm2d-171            [-1, 256, 8, 8]             512
          Conv2d-172            [-1, 256, 8, 8]         589,824
     BatchNorm2d-173            [-1, 256, 8, 8]             512
          Conv2d-174           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-175           [-1, 1024, 8, 8]           2,048
      Bottleneck-176           [-1, 1024, 8, 8]               0
          Conv2d-177            [-1, 256, 8, 8]         262,144
     BatchNorm2d-178            [-1, 256, 8, 8]             512
          Conv2d-179            [-1, 256, 8, 8]         589,824
     BatchNorm2d-180            [-1, 256, 8, 8]             512
          Conv2d-181           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-182           [-1, 1024, 8, 8]           2,048
      Bottleneck-183           [-1, 1024, 8, 8]               0
          Conv2d-184            [-1, 256, 8, 8]         262,144
     BatchNorm2d-185            [-1, 256, 8, 8]             512
          Conv2d-186            [-1, 256, 8, 8]         589,824
     BatchNorm2d-187            [-1, 256, 8, 8]             512
          Conv2d-188           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-189           [-1, 1024, 8, 8]           2,048
      Bottleneck-190           [-1, 1024, 8, 8]               0
          Conv2d-191            [-1, 256, 8, 8]         262,144
     BatchNorm2d-192            [-1, 256, 8, 8]             512
          Conv2d-193            [-1, 256, 8, 8]         589,824
     BatchNorm2d-194            [-1, 256, 8, 8]             512
          Conv2d-195           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-196           [-1, 1024, 8, 8]           2,048
      Bottleneck-197           [-1, 1024, 8, 8]               0
          Conv2d-198            [-1, 256, 8, 8]         262,144
     BatchNorm2d-199            [-1, 256, 8, 8]             512
          Conv2d-200            [-1, 256, 8, 8]         589,824
     BatchNorm2d-201            [-1, 256, 8, 8]             512
          Conv2d-202           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-203           [-1, 1024, 8, 8]           2,048
      Bottleneck-204           [-1, 1024, 8, 8]               0
          Conv2d-205            [-1, 256, 8, 8]         262,144
     BatchNorm2d-206            [-1, 256, 8, 8]             512
          Conv2d-207            [-1, 256, 8, 8]         589,824
     BatchNorm2d-208            [-1, 256, 8, 8]             512
          Conv2d-209           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-210           [-1, 1024, 8, 8]           2,048
      Bottleneck-211           [-1, 1024, 8, 8]               0
          Conv2d-212            [-1, 256, 8, 8]         262,144
     BatchNorm2d-213            [-1, 256, 8, 8]             512
          Conv2d-214            [-1, 256, 8, 8]         589,824
     BatchNorm2d-215            [-1, 256, 8, 8]             512
          Conv2d-216           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-217           [-1, 1024, 8, 8]           2,048
      Bottleneck-218           [-1, 1024, 8, 8]               0
          Conv2d-219            [-1, 512, 8, 8]         524,288
     BatchNorm2d-220            [-1, 512, 8, 8]           1,024
          Conv2d-221            [-1, 512, 4, 4]       2,359,296
     BatchNorm2d-222            [-1, 512, 4, 4]           1,024
          Conv2d-223           [-1, 2048, 4, 4]       1,048,576
     BatchNorm2d-224           [-1, 2048, 4, 4]           4,096
          Conv2d-225           [-1, 2048, 4, 4]       2,097,152
     BatchNorm2d-226           [-1, 2048, 4, 4]           4,096
      Bottleneck-227           [-1, 2048, 4, 4]               0
          Conv2d-228            [-1, 512, 4, 4]       1,048,576
     BatchNorm2d-229            [-1, 512, 4, 4]           1,024
          Conv2d-230            [-1, 512, 4, 4]       2,359,296
     BatchNorm2d-231            [-1, 512, 4, 4]           1,024
          Conv2d-232           [-1, 2048, 4, 4]       1,048,576
     BatchNorm2d-233           [-1, 2048, 4, 4]           4,096
      Bottleneck-234           [-1, 2048, 4, 4]               0
          Conv2d-235            [-1, 512, 4, 4]       1,048,576
     BatchNorm2d-236            [-1, 512, 4, 4]           1,024
          Conv2d-237            [-1, 512, 4, 4]       2,359,296
     BatchNorm2d-238            [-1, 512, 4, 4]           1,024
          Conv2d-239           [-1, 2048, 4, 4]       1,048,576
     BatchNorm2d-240           [-1, 2048, 4, 4]           4,096
      Bottleneck-241           [-1, 2048, 4, 4]               0
          Linear-242                   [-1, 10]          20,490
          ResNet-243                   [-1, 10]               0
================================================================
Total params: 42,512,970
Trainable params: 0
Non-trainable params: 42,512,970
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 100.13
Params size (MB): 162.17
Estimated Total Size (MB): 262.31
----------------------------------------------------------------
